/*
 * spa.data.case.case_12.js
 * case for data
 * 干货案例 12 - 夫妻冷战离婚，怎样挽回即将破碎的婚姻？
*/

/*jslint           browser : true,   continue : true,
  devel  : true,    indent : 2,       maxerr  : 50,
  newcap : true,     nomen : true,   plusplus : true,
  regexp : true,    sloppy : true,       vars : false,
  white  : true
*/
/*global $, spa */

spa.data.case.case_12 = (function () {
  var
    configMap = {
      main_html : String()
        + '<div class="spa-data-case">'
    	  	+ '<h2>夫妻冷战离婚，怎样挽回即将破碎的婚姻？</h2>'
    	  	+ '<p>'
    			  + '大家好，我们是橘子情感。从业八年以来，橘子情感始终秉承着“专注情感，'
            + '专业服务、专心经营”的原则，致力于为大家提供挽回爱情、挽救婚姻、分离小'
            + '三、订制爱情等两性情感服务。'
    	  	+ '</p>'
    	  	+ '<p>'
    			  + '每天会有很多人来问怎么去挽回，或者自己的感情出现了问题，到底是因为什'
            + '么，在不涉及具体纠纷的前提下，想保持好一段感情或者婚姻需要做好三点，下'
            + '面给大家慢慢讲述。'
    	  	+ '</p>'
          + '<div class="spa-data-case-img">'
            + '<img src="images/case/tu27.png" />'
          + '</div>'
    	  	+ '<h3>一．吸引力</h3>'
    	  	+ '<p>'
    			  + '这一点是比较容易理解的，简单的说就是互相之间的好感，没有任何一段感情'
            + '是单方面有吸引力能维系好的，如果真的出现那种情况，苦苦维系，对于双方都'
            + '是一种折磨，相信体验过的兄弟肯定知道其中的苦涩。'
    	  	+ '</p>'
    	  	+ '<p>'
    			  + '有很多分手案例都是因为在相处的过程中，一方不断犯错，不断降低自己的吸'
            + '引力，导致最终的分手。这种分手，女方口中的说辞一般就是“没感觉”，是啊'
            + '，当对面不再喜欢你，你不在具有吸引力的前提下，再去说些什么做些什么想'
            + '要去挽回你的感情都是没有意义的，<b>因为对方对你已经一点兴趣也没有了'
            + '，你再去苦苦的说一些挽回的话有什么用呢？</b>'
    	  	+ '</p>'
          + '<div class="spa-data-case-img">'
            + '<img src="images/case/tu28.png" />'
          + '</div>'
    	  	+ '<h3>二．联系感</h3>'
    	  	+ '<p>'
    			  + '这一点简单的讲就是双方聊天、见面约会的频率，是需要按照吸引力来的，在'
            + '你吸引力强的前提下，去保持一个比较强的联系感，两三天约一次会，每天都去'
            + '聊天是没有太大问题的，但是当你处在一个挽回的状态下，吸引力弱的前提里'
            + '，你不断的去联系目标，每天都去发早安，晚安，是没有任何意义的，严格地说'
            + '这是给目标非常大的压力，对方甚至会认为这是一种骚扰行为。'
    	  	+ '</p>'
    	  	+ '<p>'
    		  	+ '<b>'
              + '正确地构建联系感的方式是，先去分析双方之间的状态，稳定住这种状态，'
              + '再去做一定的提升，循序渐进的让彼此再“熟悉”一遍，在这个过程中重点是'
              + '让对方认识到你的改变，以及去推拉你们双方之间的情绪构建你的吸引力。'
            + '</b>'
    	  	+ '</p>'
          + '<div class="spa-data-case-img">'
            + '<img src="images/case/tu29.png" />'
          + '</div>'
    	  	+ '<h3>三．舒适感（安全感）</h3>'
    	  	+ '<p>'
    			  + '这个就是指女方和你在一起的时候感觉怎么样，你有没有给她提供到在一起相'
            + '伴的感觉，能不能你们接下去的感情中遇到问题的时候给她照顾，以及能不能有'
            + '态度的告诉她，能给她一个长期的承诺。'
    	  	+ '</p>'
    	  	+ '<p>'
    			  + '很多人理解的安全感就是不断地去给对方承诺，说自己能照顾好她一生一世，'
            + '在你们情绪都是高点的时候她当然相信你，但是一旦有一天你们之间感情出现了'
            + '问题，或者有一件事情你没有处理好，那你们之间的感情就很受印象，很多咨'
            + '询者都跟我说过，“老师怎么办，她已经完全不信任我了”那有可能就是因为你'
            + '之前这种廉价的关心，毫无意义的承诺做的太多，后续又错的太多。'
    	  	+ '</p>'
    	  	+ '<h5>'
            + '大家想一下安全感是什么，确实是在你女朋友需要帮助的时候立即出现在她的身'
            + '边，但更多的也是在她不需要帮助，仅仅是想和你情绪升温的时候表现出自己的'
            + '态度，让她认识到你是她的生命中独一无二的人。'
          + '</h5>'
    	  	+ '<p>'
    			  + '如果您有情感上的任何问题，可以咨询橘子情感的专业情感导师。橘子情感，'
            + '您身边的爱情指导挽回专家。'
    	  	+ '</p>'
      	+ '</div>'
    },
    initModule;

  initModule = (function () {
    $('.spa-main').html(configMap.main_html);
  }());
}());
