/*
 * spa.data.case.case_44.js
 * case for data
 * 干货案例 44 - 维持好长期婚姻关系，让生活不再磕磕绊绊
*/

/*jslint           browser : true,   continue : true,
  devel  : true,    indent : 2,       maxerr  : 50,
  newcap : true,     nomen : true,   plusplus : true,
  regexp : true,    sloppy : true,       vars : false,
  white  : true
*/
/*global $, spa */

spa.data.case.case_44 = (function () {
  var
    configMap = {
      main_html : String()
        + '<div class="spa-data-case">'
          + '<h2>维持好长期婚姻关系，让生活不再磕磕绊绊</h2>'
          + '<p>'
            + '我和丈夫是工作中认识的，当时觉得他的工作能力和待人接物都很好，家境良好但仍然愿意'
            + '自己奋斗，他和我表白的时候，我很吃惊但很快答应了。'
          + '</p>'
          + '<p>'
            + '双方年纪都不小了，于是很快见了双方家长筹备结婚，他的家境很好，父母都是央企退下来'
            + '的，对我始终不是很热情但也没反对。相比之下，我的父母就开心的多，第一次上门我妈妈'
            + '还专门张罗了一大桌菜。结婚之后，我们住在他家早就全款买好的房子里，我便用存款帮他'
            + '换了辆车。'
          + '</p>'
          + '<p>'
            + '婚后，他父母想要早点抱孙子就提议让我全职在家备孕，他的工作经常出差，也希望我能辞'
            + '职多顾家。于是商量之后，我就辞职在家做全职太太了，半年后我顺利怀孕，婆家和老公都'
            + '很高兴，婆婆一口一个“我孙子”，让我有点担心，我问老公万一是女孩呢，他只让我不要多'
            + '想。'
          + '</p>'
          + '<p>'
            + '我完全没有想到公婆都是知识分子，却还是重男轻女，孩子出生后，因为是女孩婆家开始有'
            + '点不冷不热，老公还好很疼女儿也安慰我说公婆年纪大了，反正也不住在一起，有时候唠叨'
            + '忍忍就好。'
          + '</p>'
          + '<p>'
            + '出了月子，我就一心一意的在家带孩子，为了给宝宝最好的，我尽量把自己的开支压缩到最'
            + '低，以前的同事、朋友也很难有时间联系。宝宝两岁以前，我的生活都非常充实，老公虽然'
            + '经常出差但很体贴，无论去多远出差都会和我视频也会给我和女儿带一些小惊喜。'
          + '</p>'
          + '<p>'
            + '第一次冲突是女儿要不要上国际幼儿园，我觉得无论如何也不能让孩子输在起跑线上，但他'
            + '却觉得小孩子不需要太娇贵，争吵了几次他说反正他不负担，最后我妥协了。但之后，我就'
            + '开始有些不平衡，总觉得他舍得为自己花钱却不舍得给女儿花钱，以前让我感动的小惊喜、'
            + '二人约会也开始变成奢侈的浪费。'
          + '</p>'
          + '<p>'
            + '女儿上了幼儿园，我的时间明显多了起来，除了家务我开始把注意力放在老公身上，但老公'
            + '好像总是很忙，即使是在家也有很多需要处理事。慢慢我有些不安全感，控制不住的想要查'
            + '他的手机，晚上在他应酬时不断找一些小事打电话，他开始还试图和我沟通，后来就比较冷'
            + '淡了。'
          + '</p>'
          + '<p>'
            + '直到有一天，老公突然说他想离婚，我一下感觉天都塌了，老公很冷静，说女儿可以归我，'
            + '他可以给我们足够的生活费。我哭着问老公为什么，求她即使为了女儿也要好好想想，他只'

            + '是说累了，觉得婚姻已经不是他想要的样子了。婆家的态度是尊重老公的意见，我和公婆的'
            + '关系也比较冷淡，我的父母着急却也使不上力。'
          + '</p>'
          + '<p>'
            + '老公提出离婚后的第二天就申请去总公司学习了，走的时候说给我一些时间好好想想。我实'
            + '在没有办法，开始在网上寻求帮助，很快我找到了橘子情感公司，看到网页上一些挽救婚姻，'
            + '挽回老公的成功案例介绍，我留下了自己的联系方式。'
          + '</p>'
          + '<p>'
            + '我接受了橘子情感公司情感分析师的分析，和长期关系维护课程，发现老公突然提出离婚可'
            + '能和其他女人有关，老公果然坦言和公司的实习生在一次出差中有了感情。我在导师的指导'
            + '下没有立刻指责老公，而是按照导师的分离小三方案逐步执行，三个月后老公和实习生彻底'
            + '断了联系，并愿意和我重新尝试。感谢橘子情感导师给我的帮助，挽回了感情拯救了我的家'
            + '庭。'
          + '</p>'
        + '</div>'
    },
    initModule;

  initModule = (function () {
    $('.spa-main').html(configMap.main_html);
  }());
}());
