/*
 * spa.data.case.case_42.js
 * case for data
 * 干货案例 42 - 被拉黑之后才懂得怎么给她想要的，挽回原来这么简单
*/

/*jslint           browser : true,   continue : true,
  devel  : true,    indent : 2,       maxerr  : 50,
  newcap : true,     nomen : true,   plusplus : true,
  regexp : true,    sloppy : true,       vars : false,
  white  : true
*/
/*global $, spa */

spa.data.case.case_42 = (function () {
  var
    configMap = {
      main_html : String()
        + '<div class="spa-data-case">'
          + '<h2>被拉黑之后才懂得怎么给她想要的，挽回原来这么简单</h2>'
          + '<p>'
            + '女人分手之后，为什么会如此的绝情？'
          + '</p>'
          + '<p>'
            + '你真的清楚分手的原因吗？ 想知道女人为什么会坚决分手吗？'
          + '</p>'
          + '<p>'
            + '我们紧紧握住的女人，为什么最后还是会失去？'
          + '</p>'
          + '<p>'
            + '挽回的重中之重，就是你要成为一个懂女人的男人。'
          + '</p>'
          + '<p>'
            + ' 我是姜浩（化名），今年已经28岁了，在工作上是属于埋头苦干的那种，所以收入也非常的'
            + ' 可观。但是另一方面，在生活上除了工作，就是平时玩玩游戏，没有什么其他兴趣。'
          + '</p>'
          + '<p>'
            + '感情方面也不尽人意，谈过几次恋爱，但是基本都是过了前期几个月的新鲜感就分了。'
          + '</p>'
          + '<p>'
            + '与薇薇在一起是因为两个人在同一个公司，并且之前有过共同的项目经验，薇薇是美工，而'
            + '我是编程，两人因为项目的关系联系越来越多，建立正式恋爱关系。'
          + '</p>'
          + '<p>'
            + '刚开始两个人是甜蜜的都要溢出来了，但是之后薇薇搬过去和我一起住的，两个人就开始产'
            + '生一些小的矛盾。因为我只玩游戏，回家之后什么都不做第一件事就是玩游戏，所有的家务'
            + '都是薇薇做。薇薇想出去玩玩，我说“还不如在家躺着舒服”。'
          + '</p>'
          + '<p>'
            + '薇薇因为这样的事情经常和我吵架，开始的时候，我经常哄薇薇，逗她开心，矛盾也就过了，'
            + '后来发现不用哄，薇薇自己哭完就好了，我也就没怎么上心这些小矛盾。'
          + '</p>'
          + '<p>'
            + '但是我有一些大男子主义，经常会对薇薇的事情指手画脚，晚上没事就会翻看薇薇的手机，'
            + '跟薇薇说不准和公司的其他男人说笑，衣服不能太露等等等等，薇薇因为这样的事情和我吵'
            + '过很多次，每次薇薇都会伤心大哭着要分手。'
          + '</p>'
          + '<p>'
            + '分手的次数说的多，我就习惯了，哄哄就好了。我觉得爱情嘛，两个人争吵很正常，男人多'
            + '忍让些，哄哄就好了。但是在一次我看来普通的争吵之后，薇薇直接摔门而走，一晚上都没'
            + '有回来。'
          + '</p>'
          + '<p>'
            + '开始我觉得她在闹小脾气，以前也有过，第二天哄哄去她家接回来就好了。'
          + '</p>'
          + '<p>'
            + '但是事情并不是如我所想，第二天发现薇薇留了字条，上面写着要和我真的分手。'
          + '</p>'
          + '<p>'
            + '我直接打电话过去，没人接，之后就不断的发信息，求原谅，说我做错了，求薇薇回来，我'
            + '以后一定不会这样了，但是薇薇回的却直接不想跟我说话。'
          + '</p>'
          + '<p>'
            + '我突然就绝望了，我没有觉得自己哪里做错了，发疯的挽回薇薇却没有任何效果。无意间发'
            + '现了橘子情感，就直接找到了他们。'
          + '</p>'
          + '<p>'
            + '导师跟我聊了近一个小时，我才意识到自己好像真的错了，开始后悔自己的所作所为，发现'
            + '自己一点都不懂薇薇的想法。'
          + '</p>'
          + '<p>'
            + '分手之后的薇薇，早已不是当初那个对爱情怀着满腔期望的女人，而是在对感情一再失望只'
            + '后，心累的感情受伤者，现在对于感情非常的敏感，受不起任何的刺激。'
          + '</p>'
          + '<p>'
            + '而我依然是按照以前的方式去对待她，但是她想要的早已不是对于物质的需求，我根本不能'
            + '满足她在感情上的需求，并且步步紧逼，压缩两人的自由空间，相处模式持续畸形。'
          + '</p>'
          + '<p>'
            + '不能满足女人对于感情的需求，没有任何的未来预期，而且加上各种情商低、不懂女性心理，'
            + '两个人的感情走向陌路是必然的结局。'
          + '</p>'
          + '<p>'
            + '我是真的知道自己做错了，所以我认真的按照导师的要求，一步一步的开始我的挽回之路。'
          + '</p>'
          + '<p>'
            + '导师针对我的这种情况，将挽回的难点重点分为以下的几个阶段：'
          + '</p>'
          + '<p>'
            + '蜕变期：给双方情绪平复的时间，男方进行针对性感情蜕变'
          + '</p>'
          + '<p>'
            + '友谊期：重启联系，展示自我，消除矛盾隔阂'
          + '</p>'
          + '<p>'
            + '吸引期：消除女方顾虑，加强吸引力和价值'
          + '</p>'
          + '<p>'
            + '挽回期：根据女方心理，把握时机，及时挽回'
          + '</p>'
          + '<p>'
            + '导师之后搜集了详细的资料，对薇薇进行了专业的心理侧写，并且根据女性的心理和情绪，'
            + '针对性的进行矛盾破解、形象重建，利用四段挽回方法，最后成功重启爱情。'
          + '</p>'
        + '</div>'
    },
    initModule;

  initModule = (function () {
    $('.spa-main').html(configMap.main_html);
  }());
}());
