/*
 * spa.data.case.case_40.js
 * case for data
 * 干货案例 40 - 老公在外找小三，教你见招拆招
*/

/*jslint           browser : true,   continue : true,
  devel  : true,    indent : 2,       maxerr  : 50,
  newcap : true,     nomen : true,   plusplus : true,
  regexp : true,    sloppy : true,       vars : false,
  white  : true
*/
/*global $, spa */

spa.data.case.case_40 = (function () {
  var
    configMap = {
      main_html : String()
        + '<div class="spa-data-case">'
          + '<h2>老公在外找小三，教你见招拆招</h2>'
          + '<p>'
            + '我其实隐约感觉到老公在外面有了人，但是苦于没有证据，老公每次回家都一副不耐烦的样'
            + '子，如果不是还要在外人面前做做样子，恐怕他连这个家都不回了。'
          + '</p>'
          + '<p>'
            + '我和我老公认识九年，结婚也有五年多了。我们有两个可爱的女儿，平时一家四口经常出去'
            + '玩，老公也非常疼爱我们的两个女儿。'
          + '</p>'
          + '<p>'
            + '虽然我们并不富有，一直没有买房，但我们两个的月薪都不低，不为吃喝发愁，也能给女儿'
            + '们很好的生活，所以我一直都觉得很幸福。'
          + '</p>'
          + '<p>'
            + '最近一年来，老公加班开会越来越多，回家倒头就睡，碰我的次数屈指可数，连话都很少说，'
            + '两个女儿想找爸爸，他也只是敷衍的抱抱，告诉她们要乖，没有以前的亲昵了。我直觉发现'
            + '他出了问题，但是我又找不到什么证据，怕直接质问他也没什么结果，所以我都忍住了。'
          + '</p>'
          + '<p>'
            + '但是一旦开始怀疑，就觉得他哪都有问题，比如我主动想求欢，他要么草草了事，要么直接'
            + '说自己累了，不想要。有时以加班为由，过半夜才回家，手机密码也改了，我多次想看他手'
            + '机，他连上厕所都带着，找不到机会。'
          + '</p>'
          + '<p>'
            + '我一直不能相信对我那么好的人有一天会出轨，但是该来的还是来了，有一天老公去洗澡，'
            + '手机放在桌上忘记了带，这时有短信进来，虽然我解不开屏保，看不见完整的短信，但是我'
            + '一看到：亲爱的，我好想你，我就崩溃了。'
          + '</p>'
          + '<p>'
            + '以前的怀疑一下子成真了，老公匆匆从洗手间里出来，但是看到我流泪拿着他手机，他就明'
            + '白我已经知道了。'
          + '</p>'
          + '<p>'
            + '无论是父母也好，好友也好都劝我们要看在孩子的份上好好想想。我很想他回心转意，但是'
            + '想到他曾经拥着别的女人如睡，我的心就一阵一阵的疼。'
          + '</p>'
          + '<p>'
            + '后来从他的朋友口中得知他出轨的对象是他的大学同学，他一直对她有点意思，在一次聚餐'
            + '中偶然遇见就发生了关系，从此他们就一直保持着联系，已经将近一年的时间了，但是我却'
            + '傻傻的被蒙在鼓里，就算有所察觉，但还是选择相信他，不愿把这件事情闹得人尽皆知。'
          + '</p>'
          + '<p>'
            + '我老公比我小三岁，学历收入都没我好，家里条件也一般，我在家里比较强势，所以婚后我'
            + '很少对他提要求，很多家里事情也不让他操心。'
          + '</p>'
          + '<p>'
            + '我以为这样就可以减少他的压力，但他还是在外面找了别的女人，这让我很痛苦，但是看着'
            + '那么小的孩子，我还是想给她们一个完整的家。'
          + '</p>'
          + '<p>'
            + '所以在朋友的介绍下我找到了橘子情感，橘子情感的导师帮我分析了老公出轨的原因可能是'
            + '因为我的性格比较强势，在家也不懂得多和老公沟通，加上老公的条件可能没我好，所以一'
            + '直有些自卑，但是我却没有及时给他疏解这种自卑，让他在家觉得很压抑，当他遇到善解人'
            + '意，还一直有好感的女同学后自然就动心了。'
          + '</p>'
          + '<p>'
            + '我在橘子情感导师的帮助下了解到了我在家庭和婚姻中的疏忽，按照导师所说的我并没有大'
            + '哭大闹指责老公的不忠，而是开诚布公的跟老公聊了聊，他说他对我是有感情的，但是就是'
            + '感觉我不理解他，给不了他家庭的温暖，他才出去找别的女人的，其实他也不舍得这个家庭。'
          + '</p>'
          + '<p>'
            + '我按照橘子情感导师的方案一步步让老公感受到家庭的温暖，老公保证跟小三断绝联系，感'
            + '谢橘子情感帮我拯救了爱情，保卫了婚姻，给我的孩子们一个完整的家。'
          + '</p>'
        + '</div>'
    },
    initModule;

  initModule = (function () {
    $('.spa-main').html(configMap.main_html);
  }());
}());
