/*
 * spa.data.case.case_43.js
 * case for data
 * 干货案例 43 - 给他合适的爱才是正确的恋爱方法，橘子情感让我重新教会我爱情
*/

/*jslint           browser : true,   continue : true,
  devel  : true,    indent : 2,       maxerr  : 50,
  newcap : true,     nomen : true,   plusplus : true,
  regexp : true,    sloppy : true,       vars : false,
  white  : true
*/
/*global $, spa */

spa.data.case.case_43 = (function () {
  var
    configMap = {
      main_html : String()
        + '<div class="spa-data-case">'
          + '<h2>给他合适的爱才是正确的恋爱方法，橘子情感让我重新教会我爱情</h2>'
          + '<p>'
            + '是不是拥有以后就会要开始失去，'
          + '</p>'
          + '<p>'
            + '我给你的越多，'
          + '</p>'
          + '<p>'
            + '你却想要躲，'
          + '</p>'
          + '<p>'
            + '爱已无法回答所有的问题。'
          + '</p>'
          + '<p>'
            + '“我男朋友觉得我爱他爱的太多了，在这段感情中我付出的太多了，他觉得自己的压力太大'
            + '了，和我提出了分手。”'
          + '</p>'
          + '<p>'
            + '很多人在感情中都会有这样的问题。比如你很喜欢TA，各种各样的付出，想把一切美好的东'
            + '西都给TA，内心往往期盼的是对方也用差不多程度的爱来回馈给你，但是一旦对方并没有这'
            + '个样子，你就会觉得对方是不是不够爱你，于是你付出的更多，用自己的一切去迁就对方。'
          + '</p>'
          + '<p>'
            + '时间久了，对方自然而然会感受到压力，就会觉得你的爱是一种负担，因为对方可能没有办'
            + '法像你爱TA一样爱你，就导致了两个人的分手。'
          + '</p>'
          + '<p>'
            + ' 我和男朋友是通过朋友介绍认识的，开始在一起确定关系之后大概有半年多了。'
          + '</p>'
          + '<p>'
            + '在这半年里，我对他的感情可以说是死心塌地，只要他找我，我不管在干嘛有多忙，我都会'
            + '尽量的去回应他。一开始他觉得和我在一起挺幸福的，不过时间一长就发现了我们之间的问'
            + '题。'
          + '</p>'
          + '<p>'
            + '我爱他爱的太深，他老是觉得我很想对他的一切都了如指掌，但是他一直忍耐着。后来他和'
            + '我说他觉得心累了，想和我分开了，我对他的好他实在是受不了了。一开始吸引他的是那个'
            + '独立的我，我知道在感情中我渐渐的迷失了自己，我很爱他。'
          + '</p>'
          + '<p>'
            + '男友说他从小事情上就能看出来我占有欲强，嫉妒心也强。但是因为一开始在一起，他就一'
            + '直在忍着，积攒到现在就不爱了，有的时候我也能感受到自己的问题，虽然嘴上说的是一心'
            + '一意对他好，但哪有人不求回报啊。现在我只想改变自己改变他，挽回这段感情。'
          + '</p>'
          + '<p>'
            + '后来和导师聊了之后，我才知道在这段感情中，我和男友是典型的焦虑型依恋和回避型依恋。'
            + '所谓的焦虑性依恋是渴望亲密关系的却常常忧心忡忡，害怕恋人的爱不能持久，回避型群体'
            + '则逃避亲密关系，认为亲密关系使他们失去自由，因而总避免与恋人过于亲密。'
          + '</p>'
          + '<p>'
            + '在恋爱中，我们一直在自欺欺人，而对前任的美化和对幻想中完美情人的执著是最主要的方'
            + '式。我总是认为逝去的恋情才美好，或者完美的爱人还在将来等待，以至于不能经营好当下'
            + '的恋情。'
          + '</p>'
          + '<p>'
            + '我的性格是比较直率任性的，在这段感情中自然而然就会表现的更加强势一些，当男朋友没'
            + '有办法在我的身上得到尊重和成就感的时候，他就自然的想要反抗我。'
          + '</p>'
          + '<p>'
            + '主要的一个原因还是在于对我对两性思维了解的不够多，没有通过更好的方式来表达出来。'
            + '当表达不够的时候，伴侣当然没有办法更好的反馈给我，因为这个时候的他其实是很压抑的，'
            + '觉得我还是不够爱他。'
          + '</p>'
          + '<p>'
            + '后来我就是遇到了橘子情感的导师，在导师的指导下我才清楚，原来自己有这么多的问题。'
          + '</p>'
          + '<p>'
            + '爱情里，我们都是没有安全感的人，因为太在意，我们都害怕失去，因为太在乎，我们一味'
            + '对对方付出，嘴里说着不介意没有得到相应的回报，但我们始终不是男友的父母，不会不求'
            + '回报的对他好。爱情里，只有一个人死心塌地付出，那是畸形的爱情。当你确定了自己的原'
            + '则之后，就不要一再退让，去学会说不，学会去做自己。'
          + '</p>'
          + '<p>'
            + '我一直都不懂他，在导师一步一步的指导下，中间也是差点做错，最终终于找到两个人真正'
            + '的正确相处方法，最终我们重新在一起了。'
          + '</p>'
        + '</div>'
    },
    initModule;

  initModule = (function () {
    $('.spa-main').html(configMap.main_html);
  }());
}());
