/*
 * spa.data.case.case_45.js
 * case for data
 * 干货案例 45 - 挽回老公的心，让婚姻走出“出轨”阴影
*/

/*jslint           browser : true,   continue : true,
  devel  : true,    indent : 2,       maxerr  : 50,
  newcap : true,     nomen : true,   plusplus : true,
  regexp : true,    sloppy : true,       vars : false,
  white  : true
*/
/*global $, spa */

spa.data.case.case_45 = (function () {
  var
    configMap = {
      main_html : String()
        + '<div class="spa-data-case">'
          + '<h2>挽回老公的心，让婚姻走出“出轨”阴影</h2>'
          + '<p>'
            + '我叫李萍（化名），今年33岁，浙江温州人。'
          + '</p>'
          + '<p>'
            + '我和老公结婚已经五年了，我们是通过同学介绍认识的。还记得一开始的时候我对他的印象'
            + '不是特别的深，感觉他也是特别普通的一个人，长相也很路人，身上并没有什么特别吸引人'
            + '的地方。后来随着大家在一起聚会，通过聊天越来越熟，我慢慢发现了虽然他没有好看的外'
            + '表，但是有一个有趣的灵魂，这也是他最吸引我的一个地方。后来关系越来越熟，我们在认'
            + '识的两个多月以后确立了恋爱关系。'
          + '</p>'
          + '<p>'
            + '谈恋爱的时候倒也没有什么太大的摩擦，他在生活上是那种特别细心的人，不但平时照顾我'
            + '的饮食起居，而且因为他的工资水平比我要高，所以会经常给我买一些小礼物什么的来哄我'
            + '开心，就这样我们在一起谈了两年多的恋爱。'
          + '</p>'
          + '<p>'
            + '随着年龄越来越大，家里父母也一直在催促我俩结婚，我也觉得他挺合适我人的，我俩在就'
            + '在恋爱两年多的时候结了婚。结了婚以后我们很快就有了宝宝，为了照顾宝宝，我辞去了工'
            + '作，专心在家里照顾孩子，而他就在外面忙工作赚钱。还记得当时怀孕的时候，他还是想多'
            + '带我出去玩玩，但是我觉得大家都结了婚了没必要再像小情侣那样黏在一起了，踏踏实实过'
            + '日子就行了。'
          + '</p>'
          + '<p>'
            + '可能真的是大家所说的“七年之痒”吧，在我们恋爱两年，结婚五年的时候我发现他最近稍微'
            + '有点不对劲，比如：和我在一起的时候经常心不在焉，一起逛街，吃饭，玩的时候，没事就'
            + '借故离开，明明没喝多少水却频繁上厕所，餐厅明明不吵信号满格却要去外面接电话，明明'
            + '口袋里有钱却说要到车里取钱……在一起呆两个小时，他能借口离开七八次。手机不离身，不'
            + '敢放在桌子上，都是装在裤兜里，开的都是震动，对方一有信息或者电话，他就借口离开出'
            + '去回复，在家里上厕所洗澡，都带手机。'
          + '</p>'
          + '<p>'
            + '通过这些蛛丝马迹，我开始怀疑他是不是外面有人了，我找了个机会翻了翻他的手机。没想'
            + '到和我猜的一样，他和一个女生已经打得火热了。一切都可以解释的通了，一切曾想不通的'
            + '最终都变成了自己被背叛的证据，而在恍然大悟的时候，那种倒吸一口凉气的不寒而颤，在'
            + '拼接那些小事的时候我的心跟着碎成了渣，明明我那么爱他，可以放弃工作放弃那么多的东'
            + '西在家相夫教子。'
          + '</p>'
          + '<p>'
            + '我选择了和他摊牌，但是让我无法接受的是，他给我的选择就是离婚，我不管怎么哭，怎么'
            + '闹都没有用。说实话，我当时都快要疯了，一边是还小的孩子另一边是变了心的老公，而我'
            + '想要的美满幸福的家庭已经没有了，我的世界感觉已经变的一片灰暗，我开始恳求老公让他'
            + '多为我想想，多为了孩子想想，而老公态度虽然有点松动，但是我们之间还是存在小三。我'
            + '不断求助各个平台和团队，想让老公放弃小三重新回到我的身边，最后我找到了橘子情感。'
          + '</p>'
          + '<p>'
            + '我还记得刚刚找到橘子情感的时候，自己是流着泪说完自己的这些故事的，团队的导师们'
            + '安抚了我的情绪，告诉我先不要着急，以前遇到过比我难挽回的情况团队们也都成功了。'
            + '听到这里我觉得可能真的是看到了希望，成为团队付费课程学员以后，导师们也迅速的给'
            + '我制定了一份挽回的计划，里面详细的分析了我的情况。我仔细的审视了自己的这段感情，'
            + '发现确实在这段感情中，我自己没有注意到的点实在是太多了，但是在这个时候我还是相信'
            + '老公并不是道德败坏的那种人，只不过是一时没有抵住诱惑，本质他还是不坏的一个人。'
          + '</p>'
          + '<p>'
            + '把这个想法和导师们沟通了以后，导师们再次给我完善了挽回计划，以我们七年的感情为基'
            + '础，让我再次和老公进行一次谈话，在这次谈话中导师详细的和我嘱咐了谈话中的细节部分，'
            + '在谈话之前导师们还给我打了一个长达一个多小时的电话，原本我是感觉谈话并没有什么太'
            + '大作用了，因为我之前也谈过很多次话了，但是让我没想到的是，在这次谈话中我遵循着导'
            + '师们给我的思路，去引导老公的感情以后，导师也建议我可以多说一说我们感情，和老公说'
            + '明我们离婚后会造成的后果，对家庭和孩子的伤害等等，果然和导师们预料的一样，老公对'
            + '我的态度并不是那么的坚决了。'
          + '</p>'
          + '<p>'
            + '导师曾经和我说过，“由于社会道德、社会舆论、社会责任和家庭义务等因素的强大作用，由'
            + '于离婚本身可能会对当事人、子女及其他家庭成员的心灵产生很大的负面影响，甚至于造成'
            + '严重的伤害。”在这个时候的谈话往往是事半功倍的。在这次谈话中，我们两个人都说出了自'
            + '己的想法，老公也说自己想要重新退回到相对安全的怀抱里，觉得还是我的怀抱更温暖。'
          + '</p>'
          + '<p>'
            + '真的特别感谢导师们，在这次挽回的过程中，如果没有你们，可能我永远不会了解老公是怎'
            + '么想的，也永远没办法和老公敞开心扉的去谈。导师们也告诉我，想要建设长期关系，我在'
            + '以后的生活中还是必须要加强自身的建设，只有这样才能拥有幸福的婚姻。'
          + '</p>'
        + '</div>'
    },
    initModule;

  initModule = (function () {
    $('.spa-main').html(configMap.main_html);
  }());
}());
