/*
 * spa.data.news.new_12.js
 * news for data
 * 新闻咨询 12 - 一个创业者的自述：橘子情感，专注情感，为爱而生
*/

/*jslint           browser : true,   continue : true,
  devel  : true,    indent : 2,       maxerr  : 50,
  newcap : true,     nomen : true,   plusplus : true,
  regexp : true,    sloppy : true,       vars : false,
  white  : true
*/
/*global $, spa */

spa.data.news.new_12 = (function () {
  var
    configMap = {
      main_html : String()
        + '<div class="spa-data-news">'
          + '<h2>一个创业者的自述：橘子情感，专注情感，为爱而生</h2>'
          + '<p>'
            + '努力不是一种选择，努力是一种能力。人不因努力而幸福，而幸福的人必有努力'
            + '的能力。'
          + '</p>'
          + '<p>'
            + '走进橘子情感，整洁的环境，专业的氛围，都让人感觉耳目一新，在橘子情感创'
            + '始人嘉伟导师的带领下，他给我讲起创业的故事。'
          + '</p>'
          + '<p>'
            + '“我是从来没有想过自己会从事到这个行业，但是现在想来，也是和自己的性格'
            + '息息相关的。”橘子情感的创始人嘉伟谈起创业的故事满脸笑意。'
          + '</p>'
          + '<p>'
            + '嘉伟老师帅气的讲起年少时期，“小时候虽然表面上是一个非常中规中矩，看起'
            + '来非常乖巧的孩子，但是我的脑海中总是会有很多的天马行空的形象，也会有很'
            + '多的新奇想法，这样的性格也逐渐的早就我后来慢慢长大和别人与众不同的性格'
            + '。”'
          + '</p>'
          + '<p>'
            + '橘子情感的创始人嘉伟，说“创立橘子情感其实是偶然也是必然的”'
          + '</p>'
          + '<p>'
            + '“情感在所有内容题材中属于最高频的，无论你打开的各大网站还是社区，最活'
            + '跃的版块依然是情感类，这个主题一直有需求、有用户、有流量，橘子情感的出'
            + '现以及正在做的就是高度聚焦情感内容消费这个品类。这是一个全新的品类，这'
            + '是一个地球上本来不存在的一个品类。‘橘子情感’的诞生正好解决了这样的痛点”橘子情感的创始人嘉伟如此说。“橘子情感的出现满足了各个年龄段情感市场的需求。”'
          + '</p>'
          + '<p>'
            + '网上情感问题的流量的快速增加，说明了自身情感出现问题的人在增加。之所以'
            + '会增加，是因为情感问题早已覆盖了绝大多数年龄段。而当今的情感问题主要以'
            + '两性情感为主，而两性情感也是人们关注度最高的情感类型。'
          + '</p>'
          + '<p>'
            + '尤其是如今的人群更加关注自身的情感，例如婚姻维稳、挽回女友、挽回老婆等'
            + '等。而且两性情感问题覆盖的面积也会逐渐扩大，年龄层次也越来越广，因此对'
            + '于情感服务有需求的人会越来越多。'
          + '</p>'
          + '<p>'
            + '“橘子情感是目前中国最专业的情感问题解决专家，橘子情感的创建是补足市场'
            + '需求的缺口，更是填补了中国情感教育的不足。”创始人嘉伟也是希望能够为中'
            + '国的发展奉献一份自己的力量，创建橘子情感弥补中国在情感教育上的缺失。'
          + '</p>'
          + '<p>'
            + ' 我们的老师教我们怎么学习，我们的父母教我们怎么生活，但是却没有人教我'
            + '们要怎么和伴侣交往，两个人应该在爱情中在婚姻中怎么生活，也正是因为这些'
            + '，才有了橘子情感的产生。'
          + '</p>'
          + '<p>'
            + '另外，其实，创立橘子情感还有一个非常重要的原因的就是因为橘子情感围绕情'
            + '感主题，延展了内容消费和服务体系，开创了情感内容消费模式。在还是一片蓝'
            + '海的情感内容消费领域。'
          + '</p>'
          + '<p>'
            + '“我们要做的很简单，就是希望能够在中国的情感教育上出自己的一份力量。我'
            + '们教的不是怎么追女孩，我们真正想解决的是，教会所有的人，两性之间怎么相'
            + '处，怎么沟通，遇到危机怎么解决，我们希望能够做到的是，你能够找到那个你'
            + '喜欢的人，并且与她相识、相知、相恋、相守，每个人都能找到并且握住属于自'
            + '己的幸福，这是我们公司的最大的目标。”'
          + '</p>'
          + '<p>'
            + '一表人才的橘子情感创始人嘉伟表示，“从开始到现在，我们每年保持倍数级的'
            + '增速，在我们的不断努力之下，这个行业可以成长为数十亿量级市场”。'
          + '</p>'
          + '<p>'
            + '帮助他人得到幸福，自己也会充满着幸福。橘子情感的理念是“专注情感，为爱'
            + '而生”，每一个情感问题的解决，都会使大家对于爱的感悟更深一分，更加爱自'
            + '己和身边的人，带给别人幸福的同时，自己的心里也是充满着快乐。'
          + '</p>'
          + '<p>'
            + '未来，橘子情感继续专注用户需求，加快社群的建设与运营，除了在线教育之外'
            + '，拓展新的服务和发展方向，为用户带来更大价值，橘子情感，为爱而生。'
          + '</p>'
        + '</div>'
    },
    initModule;

  initModule = (function () {
    $('.spa-main').html(configMap.main_html);
  }());
}());
